; domain
(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates (at ?x - rover ?y - waypoint)
             (at_lander ?x - lander ?y - waypoint)
             (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	     (equipped_for_soil_analysis ?r - rover)
             (equipped_for_rock_analysis ?r - rover)
             (equipped_for_imaging ?r - rover)
             (empty ?s - store)
             (have_rock_analysis ?r - rover ?w - waypoint)
             (have_soil_analysis ?r - rover ?w - waypoint)
             (full ?s - store)
	     (calibrated ?c - camera ?r - rover)
	     (supports ?c - camera ?m - mode)
             (available ?r - rover)
             (visible ?w - waypoint ?p - waypoint)
             (have_image ?r - rover ?o - objective ?m - mode)
             (communicated_soil_data ?w - waypoint)
             (communicated_rock_data ?w - waypoint)
             (communicated_image_data ?o - objective ?m - mode)
	     (at_soil_sample ?w - waypoint)
	     (at_rock_sample ?w - waypoint)
             (visible_from ?o - objective ?w - waypoint)
	     (store_of ?s - store ?r - rover)
	     (calibration_target ?i - camera ?o - objective)
	     (on_board ?i - camera ?r - rover)
	     (channel_free ?l - lander))


(:action navigate
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_2)
)
:effect (and (at ?param_1 ?param_3) (not (at ?param_1 ?param_2))))

(:action sample_soil
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_soil_sample ?param_3) (empty ?param_2) (equipped_for_soil_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (full ?param_2) (have_soil_analysis ?param_1 ?param_3) (not (empty ?param_2)) (not (at_soil_sample ?param_3))))

(:action sample_rock
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_rock_sample ?param_3) (empty ?param_2) (equipped_for_rock_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (have_rock_analysis ?param_1 ?param_3) (full ?param_2) (not (empty ?param_2)) (not (at_rock_sample ?param_3))))

(:action drop
:parameters (?param_1 - rover ?param_2 - store)
:precondition (and
		(full ?param_2) (store_of ?param_2 ?param_1)
)
:effect (and (empty ?param_2) (not (full ?param_2))))

(:action calibrate 
:parameters (?param_1 - rover ?param_2 - camera ?param_3 - objective ?param_4 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (calibration_target ?param_2 ?param_3) (on_board ?param_2 ?param_1) (visible_from ?param_3 ?param_4)
)
:effect (and (calibrated ?param_2 ?param_1) ))

(:action take_image 
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - objective ?param_4 - camera ?param_5 - mode) 
:precondition (and
		(at ?param_1 ?param_2) (calibrated ?param_4 ?param_1) (supports ?param_4 ?param_5) (visible_from ?param_3 ?param_2)
)
:effect (and (have_image ?param_1 ?param_3 ?param_5) (not (calibrated ?param_4 ?param_1))))

(:action communicate_soil_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_soil_analysis ?param_1 ?param_3)
)
:effect (and (communicated_soil_data ?param_3) ))

(:action communicate_rock_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_rock_analysis ?param_1 ?param_3)
)
:effect (and (communicated_rock_data ?param_3) ))

(:action communicate_image_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - objective ?param_4 - mode ?param_5 - waypoint ?param_6 - waypoint) 
:precondition (and
		(at ?param_1 ?param_5) (at_lander ?param_2 ?param_6) (have_image ?param_1 ?param_3 ?param_4)
)
:effect (and (communicated_image_data ?param_3 ?param_4) ))
)

; problem
(define (problem rover-59)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 - rover
    rover1store rover2store rover3store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 - waypoint
    camera1 camera2 camera3 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 - objective)
 (:init 
    (at_lander general waypoint5)
    (at rover1 waypoint2)
    (at rover2 waypoint1)
    (at rover3 waypoint7)
    (equipped_for_soil_analysis rover1)
    (equipped_for_soil_analysis rover3)
    (equipped_for_rock_analysis rover2)
    (equipped_for_rock_analysis rover3)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover3)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (at_rock_sample waypoint2)
    (at_rock_sample waypoint4)
    (at_soil_sample waypoint2)
    (at_soil_sample waypoint3)
    (at_soil_sample waypoint6)
    (visible waypoint7 waypoint4)
    (visible waypoint6 waypoint1)
    (visible waypoint3 waypoint2)
    (visible waypoint5 waypoint7)
    (visible waypoint2 waypoint3)
    (visible waypoint6 waypoint7)
    (visible waypoint7 waypoint6)
    (visible waypoint5 waypoint3)
    (visible waypoint1 waypoint6)
    (visible waypoint7 waypoint5)
    (visible waypoint4 waypoint7)
    (visible waypoint3 waypoint5)
    (can_traverse rover1 waypoint7 waypoint4)
    (can_traverse rover1 waypoint6 waypoint1)
    (can_traverse rover1 waypoint3 waypoint2)
    (can_traverse rover1 waypoint5 waypoint7)
    (can_traverse rover1 waypoint2 waypoint3)
    (can_traverse rover1 waypoint6 waypoint7)
    (can_traverse rover1 waypoint7 waypoint6)
    (can_traverse rover1 waypoint5 waypoint3)
    (can_traverse rover1 waypoint1 waypoint6)
    (can_traverse rover1 waypoint7 waypoint5)
    (can_traverse rover1 waypoint4 waypoint7)
    (can_traverse rover1 waypoint3 waypoint5)
    (can_traverse rover2 waypoint7 waypoint4)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint3 waypoint2)
    (can_traverse rover2 waypoint5 waypoint7)
    (can_traverse rover2 waypoint2 waypoint3)
    (can_traverse rover2 waypoint6 waypoint7)
    (can_traverse rover2 waypoint7 waypoint6)
    (can_traverse rover2 waypoint5 waypoint3)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint7 waypoint5)
    (can_traverse rover2 waypoint4 waypoint7)
    (can_traverse rover2 waypoint3 waypoint5)
    (can_traverse rover3 waypoint7 waypoint4)
    (can_traverse rover3 waypoint6 waypoint1)
    (can_traverse rover3 waypoint3 waypoint2)
    (can_traverse rover3 waypoint5 waypoint7)
    (can_traverse rover3 waypoint2 waypoint3)
    (can_traverse rover3 waypoint6 waypoint7)
    (can_traverse rover3 waypoint7 waypoint6)
    (can_traverse rover3 waypoint5 waypoint3)
    (can_traverse rover3 waypoint1 waypoint6)
    (can_traverse rover3 waypoint7 waypoint5)
    (can_traverse rover3 waypoint4 waypoint7)
    (can_traverse rover3 waypoint3 waypoint5)
    (calibration_target camera1 objective4)
    (on_board camera1 rover2)
    (supports camera1 high_res)
    (supports camera1 colour)
    (supports camera1 low_res)
    (calibration_target camera2 objective6)
    (on_board camera2 rover3)
    (supports camera2 low_res)
    (calibration_target camera3 objective2)
    (on_board camera3 rover3)
    (supports camera3 high_res)
    (visible_from objective1 waypoint6)
    (visible_from objective1 waypoint5)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint4)
    (visible_from objective1 waypoint1)
    (visible_from objective1 waypoint2)
    (visible_from objective2 waypoint1)
    (visible_from objective2 waypoint6)
    (visible_from objective2 waypoint3)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint2)
    (visible_from objective3 waypoint1)
    (visible_from objective3 waypoint5)
    (visible_from objective4 waypoint1)
    (visible_from objective4 waypoint3)
    (visible_from objective4 waypoint2)
    (visible_from objective4 waypoint5)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint4)
    (visible_from objective5 waypoint1)
    (visible_from objective5 waypoint7)
    (visible_from objective5 waypoint2)
    (visible_from objective6 waypoint4)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint7)
    (visible_from objective6 waypoint5)
    (visible_from objective6 waypoint1))
 (:goal (and 
(communicated_image_data objective5 colour)
))
)

; plan
1. (calibrate rover2 camera1 objective4 waypoint1)
   added: (calibrated camera1 rover2)
   goals met: 0 of 1
2. (navigate rover2 waypoint1 waypoint6)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint6)
   goals met: 0 of 1
3. (navigate rover2 waypoint6 waypoint7)
   deleted: (at rover2 waypoint6)
   added: (at rover2 waypoint7)
   goals met: 0 of 1
4. (take_image rover2 waypoint7 objective5 camera1 colour)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective5 colour)
   goals met: 0 of 1
5. (communicate_image_data rover2 general objective5 colour waypoint7 waypoint5)
   added: (communicated_image_data objective5 colour)
   goals met: 1 of 1
